public class Messages {
    public static final String FIRST_MESSAGE = """
            <b>🤖 Привет! Я Бот, который поможет найти тебе твой любимый трек!</b>
            
            <i>👨‍💻 Как им пользоваться?</i>
            
            • Просто напишите название трека и имя исполнителя, как вам удобно!
            
            • Легко и просто находи свои любимые треки у любимых исполнителей!
            
            <b><i>Удачи!</i></b>
            """;
    public static final String HELP_MESSAGE = """
            <b>📝 Помощь по боту:</b>
            
            <i>🎶 Как им пользоваться?</i>
            
            • Напишите название трека и исполнителя, которого хотите найти
            
            • Для навигации, используйте кнопки под сообщением
            
            • Кнопка "<u>Помощь</u>" выводит эту справку
            
            • Кнопка "<u>Поиск</u>" позволяет вам найти ваш трек
            
            • Кнопка "<u>Назад</u>" в меню поиска позволяет вам выйти в главное меню
            
            <b><i>Удачи!</i></b>
            """;
    public static final String DEFAULT_MESSAGE = "Неизвестная команда! Нажмите кнопку Помощь, или пропишите /help, для помощи";
    public static final String BACK_MESSAGE = "Вы вышли в меню, ожидаю команды! Кнопка Помощь , или команда /help, для помощи";
    public static final String SEARCH_MESSAGE = """
                                                        🎶 Введите имя исполнителя и название трека для поиска:\s
                                                       \s""";
}

